Repository: shiinayane/BiliKit-Mac
Catalog: Packages/BiliKitCore/Sources/BiliAuthFeature/Resources/Localizable.xcstrings
Source language: zh_hans
Languages: en, ja, zh_hant

source: 二维码已扫描，等待手机客户端确认登录。
en: QR code scanned. Waiting for confirmation on your phone.
ja: QRコードをスキャンしました。スマートフォンでの確認を待っています。
zh_hant: 已掃描 QR Code，正在等待手機確認登入。

source: 二维码已过期
en: QR code expired
ja: QRコードの有効期限が切れました
zh_hant: QR Code 已過期

source: 使用哔哩哔哩手机客户端扫码确认登录。
en: Scan the QR code with the Bilibili mobile app to confirm sign-in.
ja: BilibiliモバイルアプリでQRコードをスキャンし、ログインを確認します。
zh_hant: 使用 Bilibili 手機 App 掃描 QR Code 並確認登入。

source: 使用手机客户端扫描
en: Scan with the mobile app
ja: モバイルアプリでスキャン
zh_hant: 使用手機 App 掃描

source: 取消
en: Cancel
ja: キャンセル

source: 哔哩哔哩登录二维码
en: Bilibili sign-in QR code
ja: Bilibiliログイン用QRコード
zh_hant: Bilibili 登入 QR Code

source: 尚未登录
en: Not signed in
ja: 未ログイン
zh_hant: 尚未登入

source: 已登录
en: Signed in
ja: ログイン済み
zh_hant: 已登入

source: 打开哔哩哔哩手机客户端，扫描二维码。
en: Open the Bilibili mobile app and scan the QR code.
ja: Bilibiliモバイルアプリを開いて、QRコードをスキャンしてください。
zh_hant: 開啟 Bilibili 手機 App，掃描 QR Code。

source: 无法访问本机 Keychain；请解锁 Mac 后重试。
en: Keychain is unavailable. Unlock your Mac and try again.
ja: キーチェーンにアクセスできません。Macのロックを解除してからやり直してください。
zh_hant: 無法存取此 Mac 的鑰匙圈；請解鎖 Mac 後再試一次。

source: 显示登录二维码
en: Show sign-in QR code
ja: ログイン用QRコードを表示
zh_hant: 顯示登入 QR Code

source: 正在检查本机登录状态…
en: Checking sign-in status…
ja: ログイン状態を確認中…
zh_hant: 正在檢查登入狀態…

source: 正在清除本机登录状态…
en: Clearing sign-in data…
ja: ログイン情報を削除中…
zh_hant: 正在清除此 Mac 的登入狀態…

source: 正在获取登录二维码…
en: Getting sign-in QR code…
ja: ログイン用QRコードを取得中…
zh_hant: 正在取得登入 QR Code…

source: 正在验证并安全保存登录状态…
en: Verifying and securely saving sign-in data…
ja: 確認してログイン情報を安全に保存中…
zh_hant: 正在驗證並安全地儲存登入狀態…

source: 清除本机登录状态
en: Clear sign-in data
ja: ログイン情報を削除
zh_hant: 清除此 Mac 的登入狀態

source: 登录凭据仅保存在本机 Keychain。
en: Sign-in credentials are stored only in this Mac’s Keychain.
ja: ログイン情報はこのMacのキーチェーンにのみ保存されます。
zh_hant: 登入憑證只會儲存在此 Mac 的鑰匙圈中。

source: 登录协议返回了无法安全处理的数据。
en: The sign-in service returned data that could not be handled safely.
ja: ログインサービスから安全に処理できないデータが返されました。
zh_hant: 登入服務傳回了無法安全處理的資料。

source: 登录服务未接受本次请求，请重新扫码。
en: The sign-in service rejected the request. Scan a new QR code.
ja: ログインサービスがリクエストを受け付けませんでした。新しいQRコードをスキャンしてください。
zh_hant: 登入服務未接受這次要求，請重新掃描 QR Code。

source: 登录未完成
en: Sign-in incomplete
ja: ログインを完了できませんでした
zh_hant: 登入未完成

source: 网络暂时不可用，请稍后重试。
en: The network is unavailable. Try again later.
ja: ネットワークに接続できません。しばらくしてからやり直してください。
zh_hant: 網路目前無法使用，請稍後再試。

source: 请在手机上确认
en: Confirm on your phone
ja: スマートフォンで確認
zh_hant: 請在手機上確認

source: 请扫码登录
en: Scan to sign in
ja: QRコードでログイン
zh_hant: 請掃描 QR Code 登入

source: 请重新生成二维码。
en: Generate a new QR code.
ja: 新しいQRコードを生成してください。
zh_hant: 請重新產生 QR Code。

source: 账号
en: Account
ja: アカウント
zh_hant: 帳號

source: 退出登录
en: Sign out
ja: ログアウト
zh_hant: 登出

source: 重试
en: Try again
ja: 再試行
zh_hant: 再試一次

source: 重试退出
en: Try signing out again
ja: ログアウトを再試行
zh_hant: 重新登出
